esp-mosaico/esp-mosaico-utils/esp-mosaico-recovery/firmware/recovery/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# GSP 1.4 creates and validates the UI on app_main before its render task starts.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480

# Recovery retains every transport and update backend; optimize the same code
# for the fixed factory slot and let LTO remove only unreachable code.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_LTO_LINKTIME=y
CONFIG_COMPILER_LTO_COMPILETIME=y
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_IRIS_NVS_PARTITION_NAME="sysmeta"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_FACTORY_RECOVERY_BOOT_GPIO=7
CONFIG_FACTORY_RECOVERY_BOOT_DEBOUNCE_MS=50

CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=64

# USB High-Speed is the Recovery TinyUSB CDC0 link owned by ESP-Iris.
# Recovery operations and logs are exposed through the Mosaico product tools.
CONFIG_ESP_IRIS_TRANSPORT_USB=y
CONFIG_ESP_IRIS_TASK_STACK_SIZE=6144
CONFIG_ESP_IRIS_LOG_RING_BYTES=4096
CONFIG_ESP_IRIS_LOG_RING_STORAGE_INTERNAL=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_TX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_EP_BUFSIZE=8192

# GSP owns the raw CO5300 panel, touch and PSRAM frame buffers.
CONFIG_BSP_DISPLAY_ENABLE=y
# CONFIG_BSP_DISPLAY_LVGL_ENABLE is not set
CONFIG_BSP_CO5300_ENABLE_TE=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MEMTEST=n

# Recovery only joins personal/open Wi-Fi networks; it never creates an AP or
# accepts EAP identity/certificate provisioning. HTTPS Bridge is a TLS client.
# CONFIG_ESP_WIFI_SOFTAP_SUPPORT is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y

# Fixed GSPC assets need no runtime JPEG decoder. Use the GSP 1.4 link option.
# CONFIG_ESP_GSP_ENABLE_JPEG is not set
